<?php
$aGua64=array();

$aGua64['111111']=['乾为天','乾为天','坤为地','坤为地',1,1,2,2];
$aGua64['000000']=['坤为地','坤为地','乾为天','乾为天',2,2,1,1];
$aGua64['010001']=['水雷屯','雷水解','火风鼎','风火家人',3,40,50,37];
$aGua64['100010']=['山水蒙','水山蹇','泽火革','火泽睽',4,39,49,38];
$aGua64['010111']=['水天需','天水讼','火地晋','地火明夷',5,6,35,36];
$aGua64['111010']=['天水讼','水天需','地火明夷','火地晋',6,5,36,35];
$aGua64['000010']=['地水师','水地比','天火同人','火天大有',7,8,13,14];
$aGua64['010000']=['水地比','地水师','火天大有','天火同人',8,7,14,13];
$aGua64['110111']=['风天小畜','天风姤','雷地豫','地雷复',9,44,16,24];
$aGua64['111011']=['天泽履','泽天夬','地山谦','山地剥',10,43,15,23];
$aGua64['000111']=['地天泰','天地否','天地否','地天泰',11,12,12,11];
$aGua64['111000']=['天地否','地天泰','地天泰','天地否',12,11,11,12];
$aGua64['111101']=['天火同人','火天大有','地水师','水地比',13,14,7,8];
$aGua64['101111']=['火天大有','天火同人','水地比','地水师',14,13,8,7];
$aGua64['000100']=['地山谦','山地剥','天泽履','泽天夬',15,23,10,43];
$aGua64['001000']=['雷地豫','地雷复','风天小畜','天风姤',16,24,9,44];
$aGua64['011001']=['泽雷随','雷泽归妹','山风蛊','风山渐',17,54,18,53];
$aGua64['100110']=['山风蛊','风山渐','泽雷随','雷泽归妹',18,53,17,54];
$aGua64['000011']=['地泽临','泽地萃','天山遁','山天大畜',19,45,33,26];
$aGua64['110000']=['风地观','地风升','雷天大壮','天雷无妄',20,46,34,25];
$aGua64['101001']=['火雷噬嗑','雷火丰','水风井','风水涣',21,55,48,59];
$aGua64['100101']=['山火贲','火山旅','泽水困','水泽节',22,56,47,60];
$aGua64['100000']=['山地剥','地山谦','泽天夬','天泽履',23,15,43,10];
$aGua64['000001']=['地雷复','雷地豫','天风姤','风天小畜',24,16,44,9];
$aGua64['111001']=['天雷无妄','雷天大壮','地风升','风地观',25,34,46,20];
$aGua64['100111']=['山天大畜','天山遁','泽地萃','地泽临',26,33,45,19];
$aGua64['100001']=['山雷颐','雷山小过','泽风大过','风泽中孚',27,62,28,61];
$aGua64['011110']=['泽风大过','风泽中孚','山雷颐','雷山小过',28,61,27,62];
$aGua64['010010']=['坎为水','坎为水','离为火','离为火',29,29,30,30];
$aGua64['101101']=['离为火','离为火','坎为水','坎为水',30,30,29,29];
$aGua64['011100']=['泽山咸','山泽损','山泽损','泽山咸',31,41,41,31];
$aGua64['001110']=['雷风恒','风雷益','风雷益','雷风恒',32,42,42,32];
$aGua64['111100']=['天山遁','山天大畜','地泽临','泽地萃',33,26,19,45];
$aGua64['001111']=['雷天大壮','天雷无妄','风地观','地风升',34,25,20,46];
$aGua64['101000']=['火地晋','地火明夷','水天需','天水讼',35,36,5,6];
$aGua64['000101']=['地火明夷','火地晋','天水讼','水天需',36,35,6,5];
$aGua64['110101']=['风火家人','火风鼎','雷水解','水雷屯',37,50,40,3];
$aGua64['101011']=['火泽睽','泽火革','水山蹇','山水蒙',38,49,39,4];
$aGua64['010100']=['水山蹇','山水蒙','火泽睽','泽火革',39,4,38,49];
$aGua64['001010']=['雷水解','水雷屯','风火家人','火风鼎',40,3,37,50];
$aGua64['100011']=['山泽损','泽山咸','泽山咸','山泽损',41,31,31,41];
$aGua64['110001']=['风雷益','雷风恒','雷风恒','风雷益',42,32,32,42];
$aGua64['011111']=['泽天夬','天泽履','山地剥','地山谦',43,10,23,15];
$aGua64['111110']=['天风姤','风天小畜','地雷复','雷地豫',44,9,24,16];
$aGua64['011000']=['泽地萃','地泽临','山天大畜','天山遁',45,19,26,33];
$aGua64['000110']=['地风升','风地观','天雷无妄','雷天大壮',46,20,25,34];
$aGua64['011010']=['泽水困','水泽节','山火贲','火山旅',47,60,22,56];
$aGua64['010110']=['水风井','风水涣','火雷噬嗑','雷火丰',48,59,21,55];
$aGua64['011101']=['泽火革','火泽睽','山水蒙','水山蹇',49,38,4,39];
$aGua64['101110']=['火风鼎','风火家人','水雷屯','雷水解',50,37,3,40];
$aGua64['001001']=['震为雷','震为雷','巽为风','巽为风',51,51,57,57];
$aGua64['100100']=['艮为山','艮为山','兑为泽','兑为泽',52,52,58,58];
$aGua64['110100']=['风山渐','山风蛊','雷泽归妹','泽雷随',53,18,54,17];
$aGua64['001011']=['雷泽归妹','泽雷随','风山渐','山风蛊',54,17,53,18];
$aGua64['001101']=['雷火丰','火雷噬嗑','风水涣','水风井',55,21,59,48];
$aGua64['101100']=['火山旅','山火贲','水泽节','泽水困',56,22,60,47];
$aGua64['110110']=['巽为风','巽为风','震为雷','震为雷',57,57,51,51];
$aGua64['011011']=['兑为泽','兑为泽','艮为山','艮为山',58,58,52,52];
$aGua64['110010']=['风水涣','水风井','雷火丰','火雷噬嗑',59,48,55,21];
$aGua64['010011']=['水泽节','泽水困','火山旅','山火贲',60,47,56,22];
$aGua64['110011']=['风泽中孚','泽风大过','雷山小过','山雷颐',61,28,62,27];
$aGua64['001100']=['雷山小过','山雷颐','风泽中孚','泽风大过',62,27,61,28];
$aGua64['010101']=['水火既济','火水未济','火水未济','水火既济',63,64,64,63];
$aGua64['101010']=['火水未济','水火既济','水火既济','火水未济',64,63,63,64];

//ksort($aGua64);
echo "<center>";
echo "<table width=60%>";
$xuhao=array();
foreach($aGua64 as $k=>$v){
    $xuhao[$v[0]]=$v[4];    
    if($v[4]%2)echo "<tr bgcolor='#EAEEC9'>";
    else echo "<tr>";
    echo "<td>";
    echo bindec($k);
    echo "</td>";
    echo "<td>";
    echo $k;
    echo "</td>";
    echo "<td>";
    echo $v[0];
    echo "</td>";
    echo "<td>";
    echo $v[1];
    echo "</td>";
    echo "<td>";
    echo $v[2];
    echo "</td>";
    echo "<td>";
    echo $v[3];
    echo "</td>";
    echo "<td align=right>";
    echo $v[4];
    echo "</td>";
    echo "<td align=right>";
    echo $v[5];
    echo "</td>";
    echo "<td align=right>";
    echo $v[6];
    echo "</td>";
    echo "<td align=right>";
    echo $v[7];
    echo "</td>";
    echo "</tr>";
}
echo "</table>";
echo "</center>";
/*
foreach($aGua64 as $k=>$v){
    
    echo '$aGua64[';
    echo "'";
    echo $k;
    echo "']=['";
    echo $v[0];
    echo "',";
    
    echo "'";
    echo $v[1];
    echo "',";

    echo "'";
    echo $v[2];
    echo "',";

    echo "'";
    echo $v[3];
    echo "',";
    echo $v[4];
    echo ",";
    echo $xuhao[$v[1]];
    echo ",";
    echo $xuhao[$v[2]];
    echo ",";
    echo $xuhao[$v[3]];
    echo "];";
    echo "<br>";
}
*/ 
    
